import urllib3

u
infos = [
    {
        "id": 1000,
        "name": "女士",
        "children": [
            {
                "id": 1230,
                "name": "服装",
                "children": [
                    {
                        "id": 2191,
                        "name": "裙",
                        "children": [{"id": 1111, "name": "连衣裙"}],
                    },
                    {"id": 1120, "name": "针织衫"},
                ],
            },
            {
                "id": 1200,
                "name": "鞋履",
                "children": [{"id": 1210, "name": "高跟鞋"}, {"id": 1220, "name": "靴子"}],
            },
        ],
    },
    {
        "id": 2000,
        "name": "男士",
        "children": [
            {
                "id": 2100,
                "name": "服装",
                "children": [
                    {
                        "id": 4110,
                        "name": "上衣",
                        "children": [
                            {"id": 2111, "name": "T恤"},
                            {"id": 2112, "name": "POLO衫"},
                        ],
                    },
                    {"id": 2124, "name": "西装"},
                ],
            },
            {
                "id": 3212,
                "name": "鞋履",
                "children": [
                    {"id": 2210, "name": "平底鞋"},
                    {
                        "id": 2220,
                        "name": "运动鞋",
                        "children": [{"id": 2221, "name": "篮球鞋"}],
                    },
                ],
            },
        ],
    },
]


def build(n, parent, dic):
    dic[n["id"]] = {"name": n["name"], "parent": parent}
    for i in n.get("children", []):
        build(i, n["id"], dic)


def builds(infos, dic):
    for i in infos:
        build(i, -1, dic)


def check(dic, id):
    if id not in dic:
        return '不存在'

    lst = []
    while id != -1:
        lst.append(dic[id]['name'])
        id = dic[id]["parent"]
    return '>'.join(lst[::-1])


dic = {}
builds(infos, dic)
print(check(dic, 1120))
print(check(dic, 2221))


##############################
# 请根据汇率接口实现 SDK 类，可提供方法，输入币种与价格，输出人民币相应的实时价格。
rates = {
  "rates": {
    "AED": 3.673101,
    "AFN": 76.222269,
    "ALL": 114.81237,
    "AMD": 484.83815,
    "ANG": 1.794802,
    "AOA": 551.905026,
    "ARS": 67.034076,
    "AUD": 1.5278,
    "AWG": 1.8,
    "AZN": 1.700135,
    "BAM": 1.803498,
    "BBD": 2.018876,
    "BDT": 84.96982,
    "BGN": 1.80459,
    "BHD": 0.377976,
    "BIF": 1892.3704,
    "BMD": 1,
    "BND": 1.412961,
    "BOB": 6.894246,
    "BRL": 5.7327,
    "BSD": 0.999848,
    "BTN": 75.56841,
    "BWP": 12.141932,
    "BYR": 19600,
    "BZD": 2.015464,
    "CAD": 1.3921,
    "CDF": 1809.999771,
    "CHF": 0.97059,
    "CLF": 0.029928,
    "CLP": 825.801424,
    "CNY": 7.0749,
    "COP": 3896.5,
    "CRC": 568.82426,
    "CUP": 26.5,
    "CVE": 101.67686,
    "CZK": 25.103036,
    "DJF": 177.720306,
    "DKK": 6.87856,
    "DOP": 54.623247,
    "DZD": 128.83186,
    "EGP": 15.7453,
    "ERN": 14.999771,
    "ETB": 32.916046,
    "EUR": 0.9222,
    "FJD": 2.24675,
    "FKP": 0.804743,
    "GAG": 1.9917576436192,
    "GAU": 0.018164287269447,
    "GBP": 0.805,
    "GEL": 3.219898,
    "GHS": 5.751829,
    "GIP": 0.804743,
    "GMD": 51.179693,
    "GNF": 9554.432048,
    "GTQ": 7.704075,
    "GYD": 209.30715,
    "HKD": 7.7514,
    "HNL": 24.811312,
    "HRK": 6.965306,
    "HTG": 107.30963,
    "HUF": 322.249789,
    "IDR": 14904.5,
    "ILS": 3.507197,
    "INR": 75.545012,
    "IQD": 1193.6559,
    "IRR": 42105.000115,
    "ISK": 146.170283,
    "JMD": 142.79299,
    "JOD": 0.709503,
    "JPY": 106.98,
    "KES": 106.00002,
    "KGS": 78.9023,
    "KHR": 4102.133799,
    "KMF": 453.749834,
    "KPW": 900.063046,
    "KRW": 1217.07,
    "KWD": 0.3094,
    "KYD": 0.833314,
    "KZT": 421.91311,
    "LAK": 8980.926007,
    "LBP": 1511.989701,
    "LKR": 186.47766,
    "LRD": 198.498792,
    "LSL": 18.389888,
    "LTL": 2.95274,
    "LVL": 0.60489,
    "LYD": 1.417381,
    "MAD": 9.828436,
    "MDL": 17.827869,
    "MGA": 3803.340796,
    "MKD": 56.81551,
    "MMK": 1394.832901,
    "MNT": 2789.576133,
    "MOP": 7.9955691,
    "MRO": 357.00003,
    "MUR": 39.687772,
    "MVR": 15.497201,
    "MWK": 736.476495,
    "MXN": 23.604675,
    "MYR": 4.334019,
    "MZN": 68.079783,
    "NAD": 18.530026,
    "NGN": 360.502952,
    "NIO": 33.731073,
    "NOK": 10.21865,
    "NPR": 120.90939,
    "NZD": 1.62628,
    "OMR": 0.384927,
    "PAB": 0.999949,
    "PEN": 3.403061,
    "PGK": 3.493628,
    "PHP": 50.335497,
    "PKR": 159.78081,
    "PLN": 4.19405,
    "PYG": 6530.224599,
    "QAR": 3.641003,
    "RON": 4.4533,
    "RSD": 108.45502,
    "RUB": 73.440798,
    "RWF": 945.1388,
    "SAR": 3.75715,
    "SBD": 8.267992,
    "SCR": 17.240971,
    "SDG": 55.325013,
    "SEK": 9.78098,
    "SGD": 1.41223,
    "SHP": 0.804743,
    "SLL": 9860.000055,
    "SOS": 583.000045,
    "SRD": 7.458021,
    "STD": 22051.386135,
    "SVC": 8.749936,
    "SYP": 512.996905,
    "SZL": 18.45131,
    "THB": 32.1665,
    "TJS": 10.26377,
    "TMT": 3.51,
    "TND": 2.912498,
    "TOP": 2.31435,
    "TRY": 7.099602,
    "TTD": 6.756234,
    "TWD": 29.852,
    "TZS": 2314.198884,
    "UAH": 26.833323,
    "UGX": 3799.6044,
    "USD": 1,
    "UYU": 43.130022,
    "UZS": 10142.685981,
    "VEF": 9.987503,
    "VND": 23400.5,
    "VUV": 120.455492,
    "WST": 2.756438,
    "XAF": 604.86692,
    "XAG": 0.064037,
    "XAU": 0.000584,
    "XCD": 2.70255,
    "XDR": 0.734648,
    "XOF": 604.86692,
    "XPF": 109.97026,
    "YER": 250.374968,
    "ZAR": 18.307601,
    "ZMK": 9001.206089,
    "ZMW": 18.572752,
    "ZWL": 322.000001,
    "XPT": 0.00129038,
    "MXV": 3.079749,
    "IEP": 0.699154,
    "ITL": 1700.272217,
    "FRF": 1700.272217,
    "SIT": 216.486755,
    "DEM": 1.71745,
    "ECS": 25000,
    "CYP": 0.51955,
    "CNH": 6.9777,
    "NIS": 3.507197
  },
  "base": "USD",
  "last_data_at": 1589161142
}

class RateConverter:
    @staticmethod
    def convertToCNY(s):
        small = {j:i for i,j in [('USD', '$'),('GBP', '£'),('EUR', '€'),('HKD','HK$'),('JPY', '¥')]}
        coin = ''
        num = 0
        for index, c in enumerate(s):
            if c.isdigit():
                coin = s[:index]
                num = float(s[index:].replace(',', ''))
                if coin in small:
                    coin = small[coin]
                return num / rates['rates'][coin] * rates['rates']['CNY']
        return -1


for i in ['$1,999.00', 'HKD2399', 'EUR499.99', '€499.99']:
    print('输入 {}, 输出 {}'.format(i, RateConverter.convertToCNY(i)))